Core/src/Documents/ПриемИПередачаВРемонт/ПриемИПередачаВРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемИПередачаВРемонт</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаСчетовИЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПереданныеВРемонте</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыОтложенные</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыВРемонте</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗавершенияРемонта</name>
    <type>
      <types>EnumRef.ВариантыЗавершенияРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРемонта</name>
    <type>
      <types>EnumRef.ВариантыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаИзРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Гарантийный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантияНаРемонт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачаИзРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачаВСервисныйЦентр</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРемонтВыполнен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ОприходованиеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРаботы</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоПодписант</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМеханическихПовреждений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРемонта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередачаВСервисныйЦентр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщика</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеРемонта</name>
    <type>
      <types>CatalogRef.ЭтапыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияГарантии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка налога на добавленную стоимость</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РемонтОплаченПолностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияГарантии</name>
    <type>
      <types>CatalogRef.ДополнительныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПриемки</name>
    <type>
      <types>CatalogRef.ДополнительныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Предоплата</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВариантыРемонта/ВариантыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРемонта</name>
  <enumValues>
    <name>СервисЦентр</name>
  </enumValues>
  <enumValues>
    <name>НашаМастерскаяПростойРемонт</name>
  </enumValues>
  <enumValues>
    <name>НашаМастерскаяМногоэтапныйРемонт</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПриемИПередачаВРемонт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Серийные номера
	Если РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки() = Истина 
		И ЭтотОбъект.Номенклатура.ИспользоватьСерийныеНомера Тогда
		
		ПроверяемыеРеквизиты.Добавить("СерийныйНомер");
		
	КонецЕсли;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		Если РемонтВыполнен Тогда
			
			ПроверяемыеРеквизиты.Добавить("НаправлениеДеятельности");
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПередачаВСервисныйЦентр И ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр Тогда
	
		ПроверяемыеРеквизиты.Добавить("СервисЦентр");
	
	КонецЕсли;
	
	
	Если ВыдачаИзРемонта И (НЕ РемонтВыполнен) Тогда
		Если ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='სერვის-ცენტრიდან მიღებულია არ არის დაყენებული!';ru='Не установлен ""Принят из сервисного центра""!';en='Not set ""is received from the service center""!'"));
		Иначе	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='რემონტი შესრულებულია არ არის დაყენებული!';ru='Не установлен ""Ремонт выполнен""!';en='Is set to ""repair completed""!'"));
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
	Если РемонтВыполнен И ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр И (НЕ ПередачаВСервисныйЦентр) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='არ არის დაყენებული ""სერვის-ცენტრში გადაცემულია""!';ru='Не установлен ""Передан в сервисный центр""!';en='Not installed ""is transmitted to the service center""!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если ПередачаВСервисныйЦентр И РемонтВыполнен И ДатаПередачаВСервисныйЦентр > ДатаРемонтВыполнен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='სერვის-ცენტრში გადაცემის თარიღი არ შეიძლება, რომ სერვის-ცენტრიდან მიღების თარიღზე მეტი იყოს!';ru='Дата передачи в сервисный центр не может быть больше даты приема из сервисного центра!';en='Date of transmission to the service center can not be more than the date of acceptance of the service center!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если РемонтВыполнен И ВыдачаИзРемонта И ДатаРемонтВыполнен > ДатаВыдачаИзРемонта Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='რემონტის შესრულების ვადა არ შეიძლება, რომ რემონტიდან გაცემის ვადაზე მეტი იყოს!';ru='Дата выпонения ремонта не может быть больше даты выдачи из ремонта!';en='Date vyponeniya repair can not be more than the date of issue of the repair!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если ПередачаВСервисныйЦентр И Дата > ДатаПередачаВСервисныйЦентр Тогда
		Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
			//Если пользователь установил ДатаПередачаВСервисныйЦентр в новом документе до записи, она будет меньше даты и времени записи документа
			Дата = ДатаПередачаВСервисныйЦентр;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='სერვის-ცენტრში გადაცემის თარიღი არ შეიძლება, რომ სარემონტოდ მიღების თარიღზე (დოკუმენტის თარიღზე) ნაკლები იყოს!';ru='Дата передачи в сервисный центр не может быть меньше даты приема в ремонт (даты документа)!';en='Date of transmission to the service center may not be less than the date of admission to repair (document date)!'"));
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПриемИПередачаВРемонт.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	
	УправлениеНебольшойФирмойСервер.ОтразитьТоварыВРемонте(ДополнительныеСвойства, Движения, Отказ);
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
	Если (ДополнительныеСвойства.ВариантРемонта = Перечисления.ВариантыРемонта.НашаМастерскаяПростойРемонт
		ИЛИ ДополнительныеСвойства.ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр) Тогда
		
		Если ДополнительныеСвойства.РемонтВыполнен Тогда
			
			УправлениеНебольшойФирмойСервер.ОтразитьТоварыВРемонте(ДополнительныеСвойства, Движения, Отказ);
			// СерийныеНомера
			УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
			
			УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
			
			УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
			УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
			
			УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
			
		КонецЕсли;
	
		УправлениеНебольшойФирмойСервер.ОтразитьОплатаСчетовИЗаказов(ДополнительныеСвойства, Движения, Отказ);
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр Тогда
		
		УправлениеНебольшойФирмойСервер.ОтразитьТоварыПереданныеВРемонте(ДополнительныеСвойства, Движения, Отказ);
		
	КонецЕсли;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ПриемИПередачаВРемонт.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ПриемИПередачаВРемонт.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ДополнительныеСвойства.Вставить("ВариантРемонта", ВариантРемонта);
		ДополнительныеСвойства.Вставить("ПередачаВСервисныйЦентр", ПередачаВСервисныйЦентр);
		ДополнительныеСвойства.Вставить("ДатаПередачаВСервисныйЦентр", ДатаПередачаВСервисныйЦентр);
		ДополнительныеСвойства.Вставить("РемонтВыполнен", РемонтВыполнен);
		ДополнительныеСвойства.Вставить("ДатаРемонтВыполнен", ДатаРемонтВыполнен);
		ДополнительныеСвойства.Вставить("ВыдачаИзРемонта", ВыдачаИзРемонта);
		ДополнительныеСвойства.Вставить("ДатаВыдачаИзРемонта", ДатаВыдачаИзРемонта);
		ДополнительныеСвойства.Вставить("СуммаДокумента", СуммаДокумента);
	КонецЕсли;
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ПередачаВСервисныйЦентр	= Ложь;
	ЭтотОбъект.РемонтВыполнен			= Ложь;
	ЭтотОбъект.ВыдачаИзРемонта			= Ложь;
	ЭтотОбъект.ДатаПередачаВСервисныйЦентр	= Дата("00010101");
	ЭтотОбъект.ДатаРемонтВыполнен			= Дата("00010101");
	ЭтотОбъект.ДатаВыдачаИзРемонта			= Дата("00010101");
	
	ЭтотОбъект.Предоплата.Очистить();
	
КонецПроцедуры

#КонецЕсли
